Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_PVVNL.c
// the following function allows a temporary message to be displayed on the LCD	
	if(scrollLock!=0)
	{
		if(disp_timer<3)
			return;
		else
		{
			scrollLock=0;
			if(mode_has_been_changed==1)
			{
				mode_has_been_changed=0;
				fwdKeyPressed=0;	// this is to ensure that after mode display is cleared user must press either key to proceed
				revKeyPressed=0;
				someKeyPressed=0;
				bothKeysPressedCtr=0;
				disp_timer=0;
				mode_timeout_ctr=0;
				fast_display_flag=0;
				holdState=0;
				disp_state=0;
				disp_timer=disp_autoscroll_interval;	// this is to ensure entry below
			}
		}
	}
		
/*		
	if(mode_has_been_changed==1)
	{
		if(disp_timer<3)
			return;
		else
		{
			mode_has_been_changed=0;
			fwdKeyPressed=0;	// this is to ensure that after mode display is cleared user must press either key to proceed
			revKeyPressed=0;
			someKeyPressed=0;
			bothKeysPressedCtr=0;
			disp_timer=0;
			mode_timeout_ctr=0;
			fast_display_flag=0;
			holdState=0;
			disp_state=0;
			disp_timer=disp_autoscroll_interval;	// this is to ensure entry below
		}
	}
*/

	power_mode = POWERMGMT_GetMode();	// actual function to be used
		
	if (power_mode == POWERMGMT_MODE1)
	{
#ifdef BIDIR_METER		
		if((g_display_mode==0)&&(disp_state==47))
#else
		if(disp_state==0)
#endif
		{
		}
		else
			EM_LCD_DisplayStatus();
	}

	if((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)
	{
		if(g_display_mode==0)
			fast_display_flag=1;
	}
		
  if((disp_timer >= disp_autoscroll_interval)||(someKeyPressed==1)||(fast_display_flag==1))
	{
		seconds_flag=0;

		if(someKeyPressed==0)
		{
			if(g_display_mode==0)
			{
				if(autoscrollInButtonMode==0)
				{
					if(fast_display_flag==0)
					{
						if(holdState==0)
							disp_state++;
//						else
//							g_tamper_display_state++;
					}
					else
					{// here fast_display_flag = 1 - wait for autoscroll interval before incrementing state
						fast_display_counter++;
						if(fast_display_counter>disp_autoscroll_interval)
						{
							fast_display_flag=0;
							fast_display_counter=0;
							disp_state++;
						}
					}
				}
			}
			disp_timer=0;
		}
		else
		{// here some key has been pressed
			disp_timer=0;
			someKeyPressed=0;
			mode_timeout_ctr=0;
			fast_display_flag=0;
			
			if(fwdKeyPressed==1)
			{
				fwdKeyPressed=0;
				fwdKeyPressedCtr=0;
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						holdState=0;
					}
				}
				
				if(holdState==0)
					disp_state++;
//				else
//					g_tamper_display_state++;
			}
			
			if(revKeyPressed==1)
			{
				revKeyPressed=0;
				revKeyPressedCtr=0;
				
				if(g_display_mode==0)
				{
					if(autoscrollInButtonMode==0)
					{
						autoscrollInButtonMode=1;
						holdState=0;
					}
				}
				
				if(disp_state==0)
				{// we need to go to the last state
					switch(g_display_mode)
					{
						case 0:
							disp_state=36;	// last autoscroll state - 28 earlier , now 36
							break;
							
						case 1:
							disp_state=35;	// last pushbutton state - 34 earlier , now 35
							break;
							
						case 2:
							disp_state=3;	// last highres state
							break;
						
						default:
							break;
					}
				}
				else
				{
					disp_state--;
					holdState=0;
				}
			}
		}
		
		if(disp_autoscroll_interval>10)
			disp_autoscroll_interval=10;
		
			
		switch(g_display_mode)
		{
			case 0:	// autoscroll
				display_autoScroll();
				break;
				
			case 1:	// pushbutton
				display_onDemand();
				break;
				
			case 2:	// third display mode
				display_Third();
				break;
				
			default:
				makeDisplayReadyForAutoScroll();
				break;
		}
	}
}


//----------------------------------------------------------------------------------------------------------------------------------------
// this is for UNIDIR meter
/*
void displayRepeatParameters(void)
{
//	uint16_t tempint;
	int32_t templong;
  powermgmt_mode_t power_mode;
	uint8_t tempchar;
	uint8_t tmonth;
	
  LCD_ClearAll();
	disp_autoscroll_interval=10;

	if(someKeyPressed==0)
	{	
		if(((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)&&(autoscrollInButtonMode==0))
		{
			LCD_DisplayDigit(2, LCD_CHAR_C);
			LCD_DisplayDigit(3, LCD_MINUS_SIGN);
			LCD_DisplayDigit(4, 0);
			LCD_DisplayDigit(5, LCD_CHAR_P);
			LCD_DisplayDigit(6, LCD_CHAR_E);
			LCD_DisplayDigit(7, LCD_CHAR_N);
			return;
		}
	}
	else
		someKeyPressed=0;
		
	if((comm_mode!=0)&&(autoscrollInButtonMode==0))
	{
		LCD_DisplayDigit(2, LCD_CHAR_D);
		LCD_DisplayDigit(3, LCD_CHAR_N);
		LCD_DisplayDigit(4, LCD_CHAR_L);
		LCD_DisplayDigit(5, LCD_CHAR_D);
		return;
	}
	
	
	power_mode = POWERMGMT_GetMode();	// actual function to be used
	if (power_mode == POWERMGMT_MODE1)
		EM_LCD_DisplayStatus();

	if(sub_disp_state>2)
		sub_disp_state=0;	

	switch(sub_disp_state)
	{
    case 0:		// total kwh - Cumulative Forwarded
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     	break;

    case 1:		// total kvarh - lag
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvarh_lag/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykVArhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
  		LCD_DisplaySpSign(S_LAG);
			fast_display_flag=0;
     	break;
			
    case 2:		// L1 - MD      tempchar = 1;
      tmonth = decrementMonth(1);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+96,(uint8_t*)&templong,4);
      display_long_three_dp(templong);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
			fast_display_flag=0;
      break;
	}
}
*/

uint32_t gTamperEvent;
//uint8_t g_tamper_display_state;
uint8_t g_cover_display_state;
uint8_t cover_disp_timer;

void displayCOPEN(void)
{// this function gets called every second if cover open is recorded
	ext_rtc_t datetime;

  R_WDT_Restart();
			
	cover_disp_timer++;
	if(cover_disp_timer>=5)
	{
		cover_disp_timer=0;
		g_cover_display_state++;	// this variable is made 255 when the tamper is registered
		
		if(g_cover_display_state>2)
			g_cover_display_state=0;
	}
	else
	{
		EM_LCD_DisplayStatus();
		return;
	}
		
// the actual display will be updated every 5 seconds
  LCD_ClearAll();	
	EM_LCD_DisplayStatus();

	switch(g_cover_display_state)
	{
		case 0:
			LCD_DisplayDigit(2, LCD_CHAR_C);
			LCD_DisplayDigit(3, LCD_MINUS_SIGN);
			LCD_DisplayDigit(4, 0);
			LCD_DisplayDigit(5, LCD_CHAR_P);
			LCD_DisplayDigit(6, LCD_CHAR_E);
			LCD_DisplayDigit(7, LCD_CHAR_N);
//			fast_display_flag=0;
			break;
			
		case 1:	// show the date
			EPR_Read(EVENTS5_BASE_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, 0);
//			fast_display_flag=0;
			break;
			
			
