Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_PVVNL.c
		case 2:	// show the time
			EPR_Read(EVENTS5_BASE_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, 0);
//			fast_display_flag=0;
			break;
	}
}

void display_autoScroll(void)
{
	float32_t tempFloat;
	int32_t tempTodKwh;
	int32_t tempLong;
	int32_t tempLong1;
	uint16_t tempTodMD;
	uint16_t tempint;
  int16_t i[EM_NUM_OF_LINE];
	
	ext_rtc_t datetime;
	EM_PF_SIGN pf_sign;    
	uint8_t tempchar;
	uint8_t tmonth;

  R_WDT_Restart();
//  LCD_ClearAll();	// shifted below
	
	if(((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) != 0)&&(autoscrollInButtonMode==0))
	{
		displayCOPEN();		
		return;
	}
	
  LCD_ClearAll();	// earlier when above was causing COPEN message to be displayed only once and then blank screen for 4 seconds
	if((comm_mode!=0)&&(autoscrollInButtonMode==0))
	{
		LCD_DisplayDigit(2, LCD_CHAR_D);
		LCD_DisplayDigit(3, LCD_CHAR_N);
		LCD_DisplayDigit(4, LCD_CHAR_L);
		LCD_DisplayDigit(5, LCD_CHAR_D);
		return;
	}
	
	if(disp_state>36)
		disp_state=0;

	if(disp_state>0)
		EM_LCD_DisplayStatus();
		
	switch(disp_state)
	{
    case 0:			// all on
      LCD_DisplayAll();
			fast_display_flag=0;
      break;
		
    case 1:		// meter number
		  lcd_display_multiple_chars(0,6,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(Common_Data.meterNumber, LCD_LAST_POS_DIGIT,0);
			lcd_display_id();
			fast_display_flag=0;
     	break;
			
    case 2:		// time
			EM_DisplayInstantTime();
			fast_display_flag=1;
      break;

    case 3:		// date
			EM_DisplayDate();
			fast_display_flag=0;
      break;

    case 4:		// kWH
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kwh/1000, LCD_LAST_POS_DIGIT,0);
			LCD_DisplaykWhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     break;
		 
    case 5:		// kVAH
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			LCD_DisplayIntWithPos(myenergydata.kvah/1000, LCD_LAST_POS_DIGIT,0);
//			display_long_one_dp(myenergydata.kvah/100);
//			display_long_three_dp(myenergydata.kvah);
			LCD_DisplaykVAhSign();
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
     break;
	 
    case 6:		// Current MD in kW
			display_long_three_dp(mymddata.mdkw);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
			fast_display_flag=0;
      break;
		 
    case 7:		// L1 - MD      tempchar = 1;
      tmonth = decrementMonth(1);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+96,(uint8_t*)&tempLong,4);
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_BILL);
			fast_display_flag=0;
      break;
		 
    case 8:		// Cumulative MD in kW
			display_long_three_dp(ctldata.cumulative_md);
			LCD_DisplaykWSign();
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 9:		// Current MD in kVA
			display_long_three_dp(mymddata.mdkva);
  		LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
			fast_display_flag=0;
      break;
		 
    case 10:		// L1 - MD      tempchar = 1;
      tmonth = decrementMonth(1);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+240,(uint8_t*)&tempLong,4);
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_BILL);
			fast_display_flag=0;
      break;
		 
    case 11:		// Cumulative MD in kVA
			display_long_three_dp(ctldata.cumulative_md_kva);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
		  LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 12:		// Instant Load in kW
			tempLong = getInstantaneousParams(ACT_POWER,LINE_TOTAL);
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplaykWSign();
			fast_display_flag=1;
	    break;

    case 13:		// billing count
			LCD_DisplayIntWithPos(Common_Data.bpcount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_P);
		  LCD_DisplaySpSign(S_D1);	// this will convert the P to R
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

			
    case 14:		// Total Tamper count
			LCD_DisplayIntWithPos(mytmprdata.tamperCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_C);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

/*			
    case 14:		// Voltage failure count - R
			LCD_DisplayIntWithPos(mytmprdata.voltageFailureCount_R, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplayDigit(9, LCD_CHAR_V);
			LCD_DisplayDigit(8, LCD_CHAR_F);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 15:		// Voltage failure count - Y
			LCD_DisplayIntWithPos(mytmprdata.voltageFailureCount_Y, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_Y);
			LCD_DisplayDigit(9, LCD_CHAR_V);
			LCD_DisplayDigit(8, LCD_CHAR_F);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 16:		// Voltage failure count - B
			LCD_DisplayIntWithPos(mytmprdata.voltageFailureCount_B, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_B);
			LCD_DisplayDigit(9, LCD_CHAR_V);
			LCD_DisplayDigit(8, LCD_CHAR_F);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 17:		// current failure count - R
			LCD_DisplayIntWithPos(mytmprdata.currentFailureCount_R, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_F);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 18:		// current failure count - Y
			LCD_DisplayIntWithPos(mytmprdata.currentFailureCount_Y, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_Y);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_F);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 19:		// current failure count - B
			LCD_DisplayIntWithPos(mytmprdata.currentFailureCount_B, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_B);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_F);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 20:		// Voltage unbalance count
			LCD_DisplayIntWithPos(mytmprdata.voltageUnbalanceCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_V);
			LCD_DisplayDigit(8, LCD_CHAR_U);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 21:		// Current Unbalance count
			LCD_DisplayIntWithPos(mytmprdata.currentUnbalanceCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_U);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 22:		// Current Bypass count
			LCD_DisplayIntWithPos(mytmprdata.currentBypassCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_B);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 23:		// Current Reversal count - R
			LCD_DisplayIntWithPos(mytmprdata.currentReversalCount_R, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_R);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_R);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 24:		// Current Reversal count- Y
			LCD_DisplayIntWithPos(mytmprdata.currentReversalCount_Y, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_Y);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_R);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 25:		// Current Reversal count - B
			LCD_DisplayIntWithPos(mytmprdata.currentReversalCount_B, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, LCD_CHAR_B);
			LCD_DisplayDigit(9, LCD_CHAR_C);
			LCD_DisplayDigit(8, LCD_CHAR_R);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 26:		// Neutral Disturbance count
			LCD_DisplayIntWithPos(mytmprdata.neutralDisturbanceCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_N);
			LCD_DisplayDigit(8, LCD_CHAR_D);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 27:		// Magnet Tamper count
			LCD_DisplayIntWithPos(mytmprdata.magnetTamperCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_M);
			LCD_DisplayDigit(8, LCD_CHAR_T);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
*/

    case 15:		// Existing tamper if any - last item
			d_Tampers();
			fast_display_flag=0;
      break;

   	case 16:		// average pf for current month
//			tempLong = computeAveragePF(total_energy_lastSaved, apparent_energy_lastSaved, IMPORT);
			tempLong = computeAveragePF(myenergydata.kwh, myenergydata.kvah, IMPORT);
			display_long_three_dp(tempLong);
			LCD_DisplayDigit(1, LCD_CHAR_A);
			LCD_DisplayDigit(2, LCD_CHAR_P);
			LCD_DisplayDigit(3, LCD_CHAR_F);
			fast_display_flag=1;
      break;
			
