Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/display&button/lcd/em_display_PVVNL.c
		case 31:	// Last occured Tamper time
			EPR_Read(LAST_OCCURED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_O);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 32:	// Last restored Tamper
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS+8,(uint8_t *)&tempchar,sizeof(tempchar));
			displayTamperName(tempchar);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 33:	// Last restored Tamper date
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_date(datetime.date,datetime.month,datetime.year);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
		case 34:	// Last restored Tamper time
			EPR_Read(LAST_RESTORED_DETAILS_ADDRESS,(uint8_t *)&datetime,sizeof(datetime));
			lcd_display_time(datetime.hour,datetime.minute,datetime.second);
			LCD_DisplayDigit(9, LCD_CHAR_R);
			LCD_DisplayDigit(8, 1);
			fast_display_flag=0;
      break;
		
    case 35:		// Total Tamper count
			LCD_DisplayIntWithPos(mytmprdata.tamperCount, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_C);	// 06/Sep/2020
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;

		
/*			
    case 4:		// kVARH lead
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvarh_lead/100);
//			display_long_three_dp(myenergydata.kvarh_lead);
			LCD_DisplaykVArhSign();
	    LCD_DisplaySpSign(S_LEAD);	// show the ulta
			fast_display_flag=0;
     break;
	
    case 5:		// kVAH
		  lcd_display_multiple_chars(0,7,LCD_LAST_POS_DIGIT);
			display_long_one_dp(myenergydata.kvah/100);
//			display_long_three_dp(myenergydata.kvah);
			LCD_DisplaykVAhSign();
			fast_display_flag=0;
     break;
		 
    case 7:		// Current MD KVA date
			lcd_display_date(mymddata.mdkva_datetime.date,mymddata.mdkva_datetime.month,mymddata.mdkva_datetime.year);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykVASign();
     break;
		 
    case 8:		// Current MD KVA time
			lcd_display_time(mymddata.mdkva_datetime.hour,mymddata.mdkva_datetime.minute,mymddata.mdkva_datetime.second);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykVASign();
     break;
		 
    case 7:		// L1 - MD KVA
      tempchar = 1;
      tmonth = decrementMonth(tempchar);
      EPR_Read(BILLDATA_BASE_ADDRESS+(tmonth-1)*BILL_PTR_INC+240,(uint8_t*)&tempLong,4);
      display_long_three_dp(tempLong);
		  LCD_DisplaySpSign(S_MD);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_BILL);
			LCD_DisplayDigit(9, 1);
			fast_display_flag=0;
     break;

    case 8:		// Cumulative MD in kVA
			display_long_three_dp(ctldata.cumulative_md_kva);
			LCD_DisplaykVASign();
		  LCD_DisplaySpSign(S_MD);
  		LCD_DisplaySpSign(S_T8);	// CUM Sign
			fast_display_flag=0;
      break;
		 
    case 24:		// Meter Version
			display_long_two_dp(101);
			LCD_DisplayDigit(1, LCD_CHAR_V);
			LCD_DisplayDigit(2, LCD_CHAR_E);
			LCD_DisplayDigit(3, LCD_CHAR_R);
			fast_display_flag=0;
      break;
		 
    case 26:		// Total power oFF time in hours
			tempLong = ((int32_t)rtc.date-1)*((int32_t)1440)+((int32_t)rtc.hour)*((int32_t)60)+(int32_t)rtc.minute;
			tempTodKwh = ((Common_Data.cumPowerFailDuration + tempLong) - myenergydata.powerOnminutes_eb)/60;
			if(tempTodKwh<0)
				tempTodKwh = 0;
		
			LCD_DisplayIntWithPos(tempTodKwh, LCD_LAST_POS_DIGIT,0);
			LCD_DisplayDigit(1, 0);
			LCD_DisplayDigit(2, LCD_CHAR_F);
			
			LCD_DisplayDigit(9, LCD_CHAR_T);
			LCD_DisplayDigit(8, LCD_CHAR_M);
			fast_display_flag=0;
      break;
*/			
			
	}
}

void display_Third(void)
{
	int32_t temp_high_res_energy;
	
  R_WDT_Restart();
  LCD_ClearAll();

	EM_LCD_DisplayStatus();

	if(disp_state==255)
		disp_state=0;
		
	if(disp_state>3)
		disp_state=0;
	
	switch(disp_state)
	{
    case 0:			// high resolution kwh
			temp_high_res_energy = ((myenergydata.kwh%100000)*100)+(int32_t)high_resolution_kwh_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykWhSign();
			fast_display_flag=1;
      break;
			
    case 1:			// high resolution kwh - fundamental
			temp_high_res_energy = ((myenergydata.kwh_fundamental%100000)*100)+(int32_t)high_resolution_kwh_fundamental_value;
//			temp_high_res_energy = ((myenergydata.kwh_export%100000)*100)+(int32_t)high_resolution_kwh_value_export;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykWhSign();
			LCD_DisplayDigit(9, LCD_CHAR_F);
			LCD_DisplayDigit(8, LCD_CHAR_D);
			fast_display_flag=1;
      break;
			
    case 2:			// high resolution kvarh lag
			temp_high_res_energy = ((myenergydata.kvarh_lag%100000)*100)+(int32_t)high_resolution_kvarh_lag_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVArhSign();
			fast_display_flag=1;
      break;
			
    case 3:			// high resolution kvah
			temp_high_res_energy = ((myenergydata.kvah%100000)*100)+(int32_t)high_resolution_kvah_value;
			display_long_five_dp(temp_high_res_energy);
			LCD_DisplaykVAhSign();
			fast_display_flag=1;
      break;
	}
}

void d_Tampers(void)
{
	uint32_t whichevent;
	uint8_t event_code_bit;
	uint8_t whichGroup;

	if(holdState==0)
	{
		gTamperEvent = mytmprdata.tamperEvent_image&TAMPER_DISPLAY_MASK; // make all those bits not to be displayed as 0
		holdState = 1;
	}
	
	if(gTamperEvent==0)
	{// hereg_display_flag there are no tampers
		displayTamperName(0);	// 0 is to display the no tamper message
	}
	else
	{// here there is some tamper present i.e. some bits are 1
	// only those bits which are to be displayed have not been masked, transaction events and cover open etc have been masked out
    whichevent = gTamperEvent & ~(gTamperEvent-1);
		event_code_bit=findWhichBitIsOne(whichevent);	// bit numbers 1 to 15, 22, 23, 24, 29 and 30  - bit 0 is not used, others masked out
		displayTamperName(event_code_bit);
		gTamperEvent&=~whichevent;	// job complete for this fellow
	}
	
